{
	"basicData": {
		"name": "Marcelo André Robin",
		"label": "Desarrollador Fullstack - Frontend",
		"image": "",
		"email": "marcelorobin@gmail.com",
		"phone": "(+54) 11-3601-2661",
		"url": "https://johndoe.com",
		"summary": "<p>Desarrollador Fullstack apasionado por transformar ideas en aplicaciones web modernas y funcionales.<br><br>Con años de experiencia en el desarrollo de aplicaciones de escritorio, he decidido redirigir mi carrera hacia el desarrollo web, combinando mi sólida base técnica con un enfoque creativo en la experiencia del usuario. Mi objetivo es crear aplicaciones que no solo sean visualmente atractivas, sino que también resuelvan necesidades concretas de los usuarios de manera efectiva.</p><p><strong>Habilidades Destacadas:</strong></p><ul><li><strong> - Frontend:</strong> JavaScript, TypeScript, Next.js, React, Django, Laravel, Tailwind CSS, Bootstrap</li><li><strong> - Backend:</strong> Node.js, Express, FastAPI</li><li><strong> - Gestión de Proyectos:</strong> Metodologías Ágiles, Scrum</li></ul><p><strong>Logros Clave:</strong></p><ul><li> - Cofundador de Synergy2Devs, donde he liderado el desarrollo de múltiples proyectos web</li><li> - Desarrollo de 'netepScript', una herramienta que automatiza la configuración inicial de proyectos, mejorando la eficiencia del equipo en un 50%</li></ul><p><strong>Colaboración:</strong> <br><br>Actualmente busco oportunidades para colaborar en proyectos desafiantes que requieran soluciones web innovadoras. Si tu organización necesita un desarrollador fullstack que combine experiencia técnica con visión estratégica, ¡conectemos!</p>",
		"location": {
			"address": "Dr. Eleodoro Lobos 440",
			"postalCode": "1405",
			"city": "Ciudad Autónoma de Buenos Aires",
			"country": "Argentina",
			"countryCode": "AR",
			"region": "Buenos Aires"
		},
		"profiles": [
			{
				"network": "Linkedin",
				"username": "marcelorobin",
				"url": "https://www.linkedin.com/in/marcelorobin/"
			},
			{
				"network": "Github",
				"username": "mnibor",
				"url": "https://github.com/mnibor"
			},
			{
				"network": "Twitter",
				"username": "ominaca",
				"url": "https://twitter.com/ominaca"
			},
			{
				"network": "YouTube",
				"username": "Código para Principiantes",
				"url": "https://www.youtube.com/@codigoparaprincipiantes"
			}
		]
	},
	"work": [
		{
			"name": "Henry Bootcamp",
			"position": "Teaching Assistant",
			"startDate": "Agosto 2024",
			"endDate": "Actualidad",
			"summary": "Asistente de enseñanza (TA) para alumnos de Henry (Bootcamp Fullstack Developer). Tareas principales: - Coordinar el grupo de estudiantes con el objetivo de lograr su adaptación al programa - Orientar a los estudiantes en los primeros pasos de la cursada y resolver sus inquietudes - Asistir y acompañar en la resolución de ejercicios y promover la colaboración Grupal (Pair Programming) - Proponer ideas para la mejora de los procesos del Bootcamp - Promover la cohesión grupal y generar una comunidad colaborativa de estudiantes",
			"highlights": [
				"Habilidades blandas",
				"Metodologías Ágiles",
				"Comunicación interpersonal",
				"Resolución de problemas",
				"Trabajo en equipo",
				"Comunicación"
			]
		},
		{
			"name": "Desarrollador Freelance",
			"position": "Fullstack Developer",
			"startDate": "Diciembre 2020",
			"endDate": "Actualidad",
			"summary": "Durante los últimos años, me he especializado en el desarrollo y mantenimiento de sitios web, principalmente tiendas online y plataformas de comercio electrónico, utilizando tecnologías como Django, Laravel, PostgreSQL y MySQL. En respuesta a la pandemia, lideré la migración digital de varios negocios, desarrollando soluciones de comercio electrónico personalizadas que les permitieron mantenerse operativos e incluso aumentar sus ventas online en un promedio del 40%. Entre mis proyectos más destacados se encuentra el desarrollo de una tienda online para una empresa del sector gastronómico, que experimentó un crecimiento del 30% en sus ventas durante el primer trimestre tras la implementación. Varios de los proyectos que inicié durante este periodo siguen activos y generando ingresos para mis clientes, demostrando la sostenibilidad y el éxito de las soluciones implementadas.",
			"highlights": [
				"Django",
				"Laravel",
				"PostgreSQL",
				"MySQL",
				"Javascript",
				"HTML",
				"CSS",
				"Bootstrap"
			]
		},
		{
			"name": "DaiIchi Circuitos SA",
			"position": "Desarrollador de Software a medida",
			"startDate": "Julio 2008",
			"endDate": "Diciembre 2020",
			"summary": "Mi experiencia se centra en el diseño y desarrollo de soluciones de software a medida para optimizar procesos empresariales. En un proyecto clave, desarrollé software contable que mejoró significativamente la eficiencia de la facturación y el control contable, adaptándose a las necesidades específicas de la empresa. Además, me enfoqué en mejorar la productividad y los procesos internos mediante la implementación de diversas herramientas. En el área de producción, me responsabilicé de la corrección de errores críticos en el software existente, a la vez que mejoré la interfaz para visualizar datos clave del proceso productivo, optimizando su rendimiento y usabilidad. Desarrollé una aplicación para la gestión de stock de componentes electrónicos, lo que permitió un control de inventario un 20% más eficiente. También automaticé el manejo del corte de circuitos impresos mediante CNC, reduciendo el tiempo de operación en un 15% y mejorando la precisión al simplificar procesos manuales. Asimismo, diseñé una aplicación para programar el ensamblado en máquinas de inserción de componentes, agilizando los tiempos de ensamblaje en un 10%. Mi objetivo es crear soluciones tecnológicas que generen un impacto positivo y tangible en las empresas, optimizando sus procesos y mejorando su eficiencia.",
			"highlights": [
				"Visual Basic 6",
				"Visual Basic .NET",
				"PostgreSQL",
				"SQL Server",
				"Laravel",
				"CAD-CAM"
			]
		}
	],
	"education": [
		{
			"institution": "University",
			"url": "https://institution.com/",
			"area": "Software Development",
			"studyType": "Bachelor",
			"startDate": "2011-01-01",
			"endDate": "2013-01-01",
			"score": "4.0",
			"courses": ["DB1101 - Basic SQL"]
		}
	],
	"awards": [
		{
			"title": "Award",
			"date": "2014-11-01",
			"awarder": "Company",
			"summary": "There is no spoon."
		}
	],
	"certificates": [
		{
			"name": "Certificate",
			"date": "2021-11-07",
			"issuer": "Company",
			"url": "https://certificate.com"
		}
	],
	"publications": [
		{
			"name": "Publication",
			"publisher": "Company",
			"releaseDate": "2014-10-01",
			"url": "https://publication.com",
			"summary": "Description…"
		}
	],
	"skills": [
		{
			"name": "Web Development",
			"level": "Master",
			"keywords": ["HTML", "CSS", "JavaScript"]
		}
	],
	"languages": [
		{
			"language": "English",
			"fluency": "B1"
		}
	],
	"interests": [
		{
			"name": "Wildlife",
			"keywords": ["Ferrets", "Unicorns"]
		}
	],
	"references": [
		{
			"name": "Jane Doe",
			"reference": "Reference…"
		}
	],
	"projects": [
		{
			"name": "Project",
			"startDate": "2019-01-01",
			"endDate": "2021-01-01",
			"description": "Description...",
			"highlights": ["Won award at AIHacks 2016"],
			"url": "https://project.com/"
		}
	],
	"Studying": [
		{
			"institution": "Instituto Politecnico Nacional",
			"url": "https://institutopolitico.com/",
			"area": "Software Development",
			"studyType": "Bachelor",
			"startDate": "2011-01-01",
			"endDate": "2013-01-01",
			"score": "4.0",
			"courses": ["DB1101 - Basic SQL"]
		}
	]
}
